/**
 * Dare - Get a random dare challenge
 */

module.exports = {
    name: 'ᴇᴘʀᴇᴜᴠᴇ',
    aliases: ['dare', 'defi', 'défis', 'épreuve', 'epreuve'],
    category: '♞  ᴄʜᴀᴏs & ᴅɪᴠᴇʀᴛɪssᴇᴍᴇɴᴛ',
    desc: 'Get a random dare challenge',
    usage: 'dar',
    execute: async (sock, msg, args) => {
      try {
        const dares = [
          "ᴇɴᴠᴏɪᴇ ᴜɴᴇ ᴄᴀᴘᴛᴜʀᴇ ᴅ'ᴇ́ᴄʀᴀɴ ᴅᴇ ᴛᴀ ɢᴀʟᴇʀɪᴇ sᴇᴄʀᴇ̀ᴛᴇ ! 📸",
          "ʟᴀɪssᴇ ᴜɴ ᴀʟʟɪᴇ́ ᴇ́ᴄʀɪʀᴇ ᴛᴏɴ sᴛᴀᴛᴜs ᴡʜᴀᴛsᴀᴘᴘ ! ✍🏾",
          "ᴀᴘᴘᴇʟʟᴇ ᴜɴ ᴄᴏɴᴛᴀᴄᴛ ᴀᴜ ʜᴀsᴀʀᴅ ᴇᴛ ᴄʜᴀɴᴛᴇ-ʟᴜɪ ᴜɴᴇ ɪɴᴄᴀɴᴛᴀᴛɪᴏɴ ! 📞",
          "ᴘᴜʙʟɪᴇ ᴜɴ sᴇʟғɪᴇ ɢᴇ̂ɴᴀɴᴛ ᴅᴀɴs ʟᴇ sᴀɴᴄᴛᴜᴀɪʀᴇ ! 🎭",
          "ᴇ́ᴄʀɪs ᴀ̀ ᴛᴏɴ ᴄʀᴜsʜ ᴇᴛ ᴄᴏɴғᴇssᴇ ᴛᴇs sᴇɴᴛɪᴍᴇɴᴛs ! 💌",
          "ғᴀɪs 20 ᴘᴏᴍᴘᴇs ᴇᴛ ᴇɴᴠᴏɪᴇ ʟᴀ ᴘʀᴇᴜᴠᴇ ᴇɴ ᴠɪᴅᴇ́ᴏ ! 💪",
          "ᴄʜᴀɴɢᴇ ᴛᴀ ᴘʜᴏᴛᴏ ᴅᴇ ᴘʀᴏғɪʟ ᴘᴏᴜʀ ᴜɴᴇ ɪᴍᴀɢᴇ ʀɪᴅɪᴄᴜʟᴇ ᴘᴇɴᴅᴀɴᴛ 24 ʜᴇᴜʀᴇs ! 🖼️",
          "ᴇɴᴠᴏɪᴇ ᴜɴᴇ ɴᴏᴛᴇ ᴠᴏᴄᴀʟᴇ ᴏᴜ̀ ᴛᴜ ᴄʜᴀɴᴛᴇs ʟ'ᴀʟᴘʜᴀʙᴇᴛ ! 🎶",
          "ʟᴀɪssᴇ ʟᴇ ɢʀᴏᴜᴘᴇ ᴄʜᴏɪsɪʀ ᴛᴏɴ sᴛᴀᴛᴜs ᴘᴏᴜʀ ʟᴀ ᴊᴏᴜʀɴᴇ́ᴇ ! 📜",
          "ʀᴀᴄᴏɴᴛᴇ ᴀᴜ ɢʀᴏᴜᴘᴇ ᴛᴏɴ ᴍᴏᴍᴇɴᴛ ʟᴇ ᴘʟᴜs ᴇᴍʙᴀʀʀᴀssᴀɴᴛ ! 😳",
          "ᴘᴀʀᴛᴀɢᴇ ʟᴇs 5 ᴅᴇʀɴɪᴇ̀ʀᴇs ʀᴇᴄʜᴇʀᴄʜᴇs ᴅᴇ ᴛᴏɴ ᴏʀᴀᴄʟᴇ ɢᴏᴏɢʟᴇ ! 🔍",
          "ᴅᴀɴsᴇ ᴅᴇᴠᴀɴᴛ ᴛᴏᴜᴛ ʟᴇ ᴍᴏɴᴅᴇ ᴘᴇɴᴅᴀɴᴛ 1 ᴍɪɴᴜᴛᴇ ! 💃",
          "ɪᴍɪᴛᴇ ᴜɴ ᴍᴇᴍʙʀᴇ ᴅᴜ sᴀɴᴄᴛᴜᴀɪʀᴇ ᴅᴇ ᴛᴏɴ ᴍɪᴇᴜx ! 🗣️",
          "ᴘᴀʀʟᴇ ᴀᴠᴇᴄ ᴜɴ ᴀᴄᴄᴇɴᴛ ᴇ́ᴛʀᴀɴɢᴇ ᴘᴇɴᴅᴀɴᴛ ʟᴇs 10 ᴘʀᴏᴄʜᴀɪɴᴇs ᴍɪɴᴜᴛᴇs ! 🌍",
          "ᴘᴜʙʟɪᴇ ᴜɴᴇ sᴛᴏʀʏ ᴅɪsᴀɴᴛ 'ᴊ'ᴀɪ ᴘᴇʀᴅᴜ ᴜɴ ᴘᴀʀɪ' ᴘᴇɴᴅᴀɴᴛ 24 ʜᴇᴜʀᴇs ! 🃏",
          "ʟᴀɪssᴇ ᴜɴᴇ ᴘᴇʀsᴏɴɴᴇ ғᴏᴜɪʟʟᴇʀ ᴛᴏɴ ᴛᴇ́ʟᴇ́ᴘʜᴏɴᴇ ᴘᴇɴᴅᴀɴᴛ 2 ᴍɪɴᴜᴛᴇs ! 📱",
          "ᴇɴᴠᴏɪᴇ ᴜɴ ᴍᴇssᴀɢᴇ ᴅᴇ sᴇ́ᴅᴜᴄᴛɪᴏɴ ᴀ̀ ᴜɴ ᴄᴏɴᴛᴀᴄᴛ ᴀᴜ ʜᴀsᴀʀᴅ ! 😏",
          "ᴇxᴇ́ᴄᴜᴛᴇ 50 ᴊᴜᴍᴘɪɴɢ ᴊᴀᴄᴋs ! 🤸",
          "ʀᴀᴄᴏɴᴛᴇ ᴜɴᴇ ʙʟᴀɢᴜᴇ. sɪ ᴘᴇʀsᴏɴɴᴇ ɴᴇ ʀɪᴛ, ᴛᴜ ᴅᴏɪs sᴜʙɪʀ ᴜɴ ᴀᴜᴛʀᴇ ᴅᴇ́ғɪ ! 🃏",
          "ᴇɴʀᴇɢɪsᴛʀᴇ-ᴛᴏɪ ᴇɴ ᴛʀᴀɪɴ ᴅᴇ ғᴀɪʀᴇ ᴜɴᴇ ᴅᴀɴsᴇ ᴛɪᴋᴛᴏᴋ ! 🎬"
        ];
        
  
        
        const randomDare = dares[Math.floor(Math.random() * dares.length)];
        
        await sock.sendMessage(msg.key.remoteJid, {
          text: `${randomDare}`
        }, { quoted: msg });
        
      } catch (error) {
        console.error('Dare Error:', error);
        await sock.sendMessage(msg.key.remoteJid, {
          text: `❌ Error: ${error.message}`
        }, { quoted: msg });
      }
    }
  };
  